Revit 2016 API
AssemblyViewUtils Methods
The AssemblyViewUtils type exposes the following members.
Methods
Name | Description
AcquireAssemblyViews
 Transfers the assembly views owned by a source assembly instance to a target sibling assembly instance of the same assembly type.
Create3DOrthographic
 Creates a new orthographic 3D assembly view for the assembly instance.
CreateDetailSection
 Creates a new detail section assembly view for the assembly instance.
CreateMaterialTakeoff
 Creates a new material takeoff multicategory schedule assembly view for the assembly instance.
CreatePartList
 Creates a new part list multicategory schedule assembly view for the assembly instance.
CreateSheet
 Creates a new sheet assembly view for the assembly instance.
CreateSingleCategorySchedule
 Creates a new single-category schedule assembly view for the assembly instance.
See Also
AssemblyViewUtils Class
Autodesk.Revit.DB Namespace